giraydorukyurt7/STM32-Tutorial-Projects/006_1_STDP_DAC/src/main.c
#include "stm32f4xx.h"
#include "stm32f4_discovery.h"

int i = 0;

void delay(uint32_t time)
{
	while(time--);
}

GPIO_InitTypeDef GPIO_InitStruct;
DAC_InitTypeDef DAC_InitStruct;

void GPIO_Config()
	{
		 RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);

		 //Bu structure GPIOA  (A) portuna atandi
		 GPIO_InitStruct.GPIO_Mode		 = GPIO_Mode_AN; //or just 0x00;
		 GPIO_InitStruct.GPIO_Pin		 = GPIO_Pin_5;
		 GPIO_InitStruct.GPIO_OType		 = GPIO_OType_PP;
		 GPIO_InitStruct.GPIO_PuPd		 = GPIO_PuPd_NOPULL;
		 GPIO_InitStruct.GPIO_Speed		 = GPIO_Speed_100MHz;

		 GPIO_Init(GPIOA, &GPIO_InitStruct);
	}

void DAC2_Config()
{
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE);

	DAC_InitStruct.DAC_WaveGeneration				= DAC_WaveGeneration_None;
	DAC_InitStruct.DAC_Trigger						= DAC_Trigger_None;
	DAC_InitStruct.DAC_OutputBuffer					= DAC_OutputBuffer_Enable;

	DAC_Init(DAC_Channel_2, &DAC_InitStruct);

	DAC_Cmd(DAC_Channel_2, ENABLE);
}


int main(void)
{
	GPIO_Config();
	DAC2_Config();
	while (1)
	{
		for(;i<255;i++)
		{
			DAC_SetChannel2Data(DAC_Align_8b_R, i);
			delay(100000);
		}
		i = 0;
	}
}

void EVAL_AUDIO_TransferComplete_CallBack(uint32_t pBuffer, uint32_t Size)
{
  /* TODO, implement your code here */
  return;
}

uint16_t EVAL_AUDIO_GetSampleCallBack(void)
{
  /* TODO, implement your code here */
  return -1;
}
